<center> Name:Quratulain<br>
Email:QuratulainkhanAIML1@outlook.com<br>
Github:QuratulainkhanAIML1<br>
Title:Practicebyq</center>

# This is my first python file.

In [63]:
# This is a code to print hello welcome to python.
print("Hello, Welcome to Python")

Hello, Welcome to Python

In [64]:
# This is a code to print version of system.
import sys

print(sys.version)

3.13.2 (tags/v3.13.2:4f8bb39, Feb  4 2025, 15:23:48) [MSC v.1942 64 bit (AMD64)]

In [65]:
#This is a  code for while statement
if 5 > 2:
  print("Five is greater than two!")

Five is greater than two!

In [66]:
# This is a code to create variable and assign values to it and then print values
x = 5
y = "Hello, World!"
print(x)
y

5

'Hello, World!'

In [67]:
# This is a code for declaring data type of variable 
# through casting
y=int(9)
print(y)

9

In [68]:
a=2
b=3
p=a*b
m=b-a
s=a+b
d=a/2
print(p)
print(m)
print(s)
print(d)

6
1
5
1.0

In [69]:
 # addition
print ('Sum: ', a + b)  

# subtraction
print ('Subtraction: ', a - b)   

# multiplication
print ('Multiplication: ', a * b)  

# division
print ('Division: ', a / b) 

# floor division
print ('Floor Division: ', a // b)

# modulo
print ('Modulo: ', a % b)  

# a to the power b
print ('Power: ', a ** b)

Sum:  5
Subtraction:  -1
Multiplication:  6
Division:  0.6666666666666666
Floor Division:  0
Modulo:  2
Power:  8

In [70]:
a = 5
b = 2

print (a > b)
print(b>a)

True
False

In [71]:
a = 6
b = 4
print((a > 2) and (b >= 6))

False

In [72]:
message = 'I live in Pakistan'
# check if 'H' is present in message string
print('H' in message) 

# check if 'Pakistan' is present in message string
print('Pakistan'in message)

False
True

In [73]:
number = -5

if number > 0:
    print('Positive number')
else:
    print("Negative number")

print('This statement is always executed')

Negative number
This statement is always executed

In [74]:
number = -2

# outer if statement
if number >= 0:
    # inner if statement
    if number == 0:
      print('Number is 0')
    
    # inner else statement
    else:
        print('Number is positive')

# outer else statement
else:
    print('Number is negative')

Number is negative

In [75]:
thislist = ["apple", "banana", "cherry"]
print(thislist)

['apple', 'banana', 'cherry']

step1.Install library

In [1]:
%pip install pandas

Requirement already satisfied: pandas in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\qurat\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: six>=1.5 in c:\users\qurat\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

step2.import pandas

In [2]:
import pandas as pd

Step3. Loading data set

In [3]:
pd.read_csv('data.csv')

             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0        NaN
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
9        Abdullah     Teacher      M   55.0        NaN
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

In [4]:
df=pd.read_csv('data.csv')
print("This is my Csv dataset")
df

This is my Csv dataset

             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0        NaN
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
9        Abdullah     Teacher      M   55.0        NaN
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

step4:loading excel file

In [5]:
%pip install pandas openpyxl

Requirement already satisfied: pandas in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: openpyxl in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (3.1.5)
Requirement already satisfied: numpy>=1.26.0 in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\qurat\appdata\roaming\python\python313\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: tzdata>=2022.7 in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2025.1)
Requirement already satisfied: et-xmlfile in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (from openpyxl) (2.0.0)
Requirement already satisfied: six>=1.5 in c:\users\qurat\appdata\roaming\python\python313\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
Note: you may need to restart the kernel to use updated packages.

In [6]:
# print excel file
print("This is my excel dataset.")
pd.read_excel('data.xlsx')

This is my excel dataset.

             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0        NaN
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
9        Abdullah     Teacher      M   55.0        NaN
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

In [7]:
print("This is my excel dataset.")
df=pd.read_excel('data.xlsx')
df

This is my excel dataset.

             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0        NaN
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
9        Abdullah     Teacher      M   55.0        NaN
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

step5:Displaying info about data

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17 entries, 0 to 16
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Name         17 non-null     object
 1   Designation  17 non-null     object
 2   Gender       17 non-null     object
 3   Age          16 non-null     float64
 4   Salary       15 non-null     float64
dtypes: float64(2), object(3)
memory usage: 812.0+ bytes

step6.load first 5 values

In [9]:
df.head()

            Name Designation Gender   Age     Salary
0        Mukhtar   Professor      M  37.0   115000.0
1          Azziz     Teacher      M  30.0    35000.0
2         Mohsin    Engineer      M  29.0    50000.0
3  Naveed Fatima     Analyst      F  30.0    70000.0
4          Babar    Engineer      F  25.0  1500000.0

In [10]:
df.head(10)

            Name Designation Gender   Age     Salary
0        Mukhtar   Professor      M  37.0   115000.0
1          Azziz     Teacher      M  30.0    35000.0
2         Mohsin    Engineer      M  29.0    50000.0
3  Naveed Fatima     Analyst      F  30.0    70000.0
4          Babar    Engineer      F  25.0  1500000.0
5           Aqsa   Scientist      F  22.0        NaN
6          Rafia     Analyst      F  29.0    20000.0
7          Samra   Scientist      F  26.0   115000.0
8           Eman    Engineer      F  28.0    35000.0
9       Abdullah     Teacher      M  55.0        NaN

In [11]:
# displaying last 5 values
df.tail()

      Name Designation Gender    Age    Salary
12   Ahsan     trainer      M  156.0  110000.0
13   Wajid     teacher      M   67.0    2000.0
14   Naeem     trainer      M   80.0   16000.0
15  Qaisar   professor      M   20.0  170000.0
16   Wajid    Engineer      M   85.0  190000.0

In [12]:
# displaying last 2 values
df.tail(2)

      Name Designation Gender   Age    Salary
15  Qaisar   professor      M  20.0  170000.0
16   Wajid    Engineer      M  85.0  190000.0

In [76]:
#displaying summary about data
df.describe()

              Age        Salary
count   15.000000  1.500000e+01
mean    50.045833  1.725333e+05
std     36.043318  3.713435e+05
min     20.000000  2.000000e+03
25%     28.500000  3.500000e+04
50%     30.000000  7.000000e+04
75%     63.500000  1.150000e+05
max    156.000000  1.500000e+06

In [14]:
# displaying  a spcific value
df.loc[8]

Name               Eman
Designation    Engineer
Gender                F
Age                28.0
Salary          35000.0
Name: 8, dtype: object

In [15]:
# displaying  a spcific valued range
df.loc[8:12]

        Name Designation Gender    Age    Salary
8       Eman    Engineer      F   28.0   35000.0
9   Abdullah     Teacher      M   55.0       NaN
10     Mosib   professor      M   60.0   70000.0
11     Ahmed    engineer      M    NaN   90000.0
12     Ahsan     trainer      M  156.0  110000.0

In [16]:
# to check null values
df.isnull().sum()

Name           0
Designation    0
Gender         0
Age            1
Salary         2
dtype: int64

In [17]:
 # to display a specific column or features
df['Age']

0      37.0
1      30.0
2      29.0
3      30.0
4      25.0
5      22.0
6      29.0
7      26.0
8      28.0
9      55.0
10     60.0
11      NaN
12    156.0
13     67.0
14     80.0
15     20.0
16     85.0
Name: Age, dtype: float64

In [18]:
df['Age'].isnull().sum()

np.int64(1)

In [19]:
%pip install python-docx

Requirement already satisfied: python-docx in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (1.1.2)
Requirement already satisfied: lxml>=3.1.0 in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (from python-docx) (5.3.1)
Requirement already satisfied: typing-extensions>=4.9.0 in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (from python-docx) (4.12.2)
Note: you may need to restart the kernel to use updated packages.

In [20]:
%pip install pymupdf

Requirement already satisfied: pymupdf in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (1.25.3)
Note: you may need to restart the kernel to use updated packages.

In [21]:
# This is data from sql file
import sqlite3
conn = sqlite3.connect("data.db")
cursor = conn.cursor()
cursor.execute("SELECT* FROM sqlite_master WHERE type='table';")
tables = cursor.fetchall()
print("Tables in Data file:" , tables)
cursor.execute("SELECT * FROM customers LIMIT 4;")
customers = cursor.fetchall()
for customer in customers:
    print(customer)

conn.close()

Tables in Data file: [('table', 'albums', 'albums', 2, 'CREATE TABLE "albums"\r\n(\r\n    [AlbumId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [Title] NVARCHAR(160)  NOT NULL,\r\n    [ArtistId] INTEGER  NOT NULL,\r\n    FOREIGN KEY ([ArtistId]) REFERENCES "artists" ([ArtistId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION\r\n)'), ('table', 'sqlite_sequence', 'sqlite_sequence', 3, 'CREATE TABLE sqlite_sequence(name,seq)'), ('table', 'artists', 'artists', 4, 'CREATE TABLE "artists"\r\n(\r\n    [ArtistId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [Name] NVARCHAR(120)\r\n)'), ('table', 'customers', 'customers', 5, 'CREATE TABLE "customers"\r\n(\r\n    [CustomerId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [FirstName] NVARCHAR(40)  NOT NULL,\r\n    [LastName] NVARCHAR(20)  NOT NULL,\r\n    [Company] NVARCHAR(80),\r\n    [Address] NVARCHAR(70),\r\n    [City] NVARCHAR(40),\r\n    [State] NVARCHAR(40),\r\n    [Country] NVARCHAR(40),\r\n    [PostalCode] NVARCHAR(10),\r\n    [Phone] NVARCHAR(24),\r\n    [Fax] NVARCHAR(24),\r\n    [Email] NVARCHAR(60)  NOT NULL,\r\n    [SupportRepId] INTEGER,\r\n    FOREIGN KEY ([SupportRepId]) REFERENCES "employees" ([EmployeeId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION\r\n)'), ('table', 'employees', 'employees', 8, 'CREATE TABLE "employees"\r\n(\r\n    [EmployeeId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [LastName] NVARCHAR(20)  NOT NULL,\r\n    [FirstName] NVARCHAR(20)  NOT NULL,\r\n    [Title] NVARCHAR(30),\r\n    [ReportsTo] INTEGER,\r\n    [BirthDate] DATETIME,\r\n    [HireDate] DATETIME,\r\n    [Address] NVARCHAR(70),\r\n    [City] NVARCHAR(40),\r\n    [State] NVARCHAR(40),\r\n    [Country] NVARCHAR(40),\r\n    [PostalCode] NVARCHAR(10),\r\n    [Phone] NVARCHAR(24),\r\n    [Fax] NVARCHAR(24),\r\n    [Email] NVARCHAR(60),\r\n    FOREIGN KEY ([ReportsTo]) REFERENCES "employees" ([EmployeeId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION\r\n)'), ('table', 'genres', 'genres', 10, 'CREATE TABLE "genres"\r\n(\r\n    [GenreId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [Name] NVARCHAR(120)\r\n)'), ('table', 'invoices', 'invoices', 11, 'CREATE TABLE "invoices"\r\n(\r\n    [InvoiceId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [CustomerId] INTEGER  NOT NULL,\r\n    [InvoiceDate] DATETIME  NOT NULL,\r\n    [BillingAddress] NVARCHAR(70),\r\n    [BillingCity] NVARCHAR(40),\r\n    [BillingState] NVARCHAR(40),\r\n    [BillingCountry] NVARCHAR(40),\r\n    [BillingPostalCode] NVARCHAR(10),\r\n    [Total] NUMERIC(10,2)  NOT NULL,\r\n    FOREIGN KEY ([CustomerId]) REFERENCES "customers" ([CustomerId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION\r\n)'), ('table', 'invoice_items', 'invoice_items', 13, 'CREATE TABLE "invoice_items"\r\n(\r\n    [InvoiceLineId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [InvoiceId] INTEGER  NOT NULL,\r\n    [TrackId] INTEGER  NOT NULL,\r\n    [UnitPrice] NUMERIC(10,2)  NOT NULL,\r\n    [Quantity] INTEGER  NOT NULL,\r\n    FOREIGN KEY ([InvoiceId]) REFERENCES "invoices" ([InvoiceId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION,\r\n    FOREIGN KEY ([TrackId]) REFERENCES "tracks" ([TrackId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION\r\n)'), ('table', 'media_types', 'media_types', 15, 'CREATE TABLE "media_types"\r\n(\r\n    [MediaTypeId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [Name] NVARCHAR(120)\r\n)'), ('table', 'playlists', 'playlists', 16, 'CREATE TABLE "playlists"\r\n(\r\n    [PlaylistId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [Name] NVARCHAR(120)\r\n)'), ('table', 'playlist_track', 'playlist_track', 17, 'CREATE TABLE "playlist_track"\r\n(\r\n    [PlaylistId] INTEGER  NOT NULL,\r\n    [TrackId] INTEGER  NOT NULL,\r\n    CONSTRAINT [PK_PlaylistTrack] PRIMARY KEY  ([PlaylistId], [TrackId]),\r\n    FOREIGN KEY ([PlaylistId]) REFERENCES "playlists" ([PlaylistId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION,\r\n    FOREIGN KEY ([TrackId]) REFERENCES "tracks" ([TrackId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION\r\n)'), ('table', 'tracks', 'tracks', 20, 'CREATE TABLE "tracks"\r\n(\r\n    [TrackId] INTEGER PRIMARY KEY AUTOINCREMENT NOT NULL,\r\n    [Name] NVARCHAR(200)  NOT NULL,\r\n    [AlbumId] INTEGER,\r\n    [MediaTypeId] INTEGER  NOT NULL,\r\n    [GenreId] INTEGER,\r\n    [Composer] NVARCHAR(220),\r\n    [Milliseconds] INTEGER  NOT NULL,\r\n    [Bytes] INTEGER,\r\n    [UnitPrice] NUMERIC(10,2)  NOT NULL,\r\n    FOREIGN KEY ([AlbumId]) REFERENCES "albums" ([AlbumId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION,\r\n    FOREIGN KEY ([GenreId]) REFERENCES "genres" ([GenreId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION,\r\n    FOREIGN KEY ([MediaTypeId]) REFERENCES "media_types" ([MediaTypeId]) \r\n\t\tON DELETE NO ACTION ON UPDATE NO ACTION\r\n)'), ('table', 'sqlite_stat1', 'sqlite_stat1', 864, 'CREATE TABLE sqlite_stat1(tbl,idx,stat)')]
(1, 'Luís', 'Gonçalves', 'Embraer - Empresa Brasileira de Aeronáutica S.A.', 'Av. Brigadeiro Faria Lima, 2170', 'São José dos Campos', 'SP', 'Brazil', '12227-000', '+55 (12) 3923-5555', '+55 (12) 3923-5566', 'luisg@embraer.com.br', 3)
(2, 'Leonie', 'Köhler', None, 'Theodor-Heuss-Straße 34', 'Stuttgart', None, 'Germany', '70174', '+49 0711 2842222', None, 'leonekohler@surfeu.de', 5)
(3, 'François', 'Tremblay', None, '1498 rue Bélanger', 'Montréal', 'QC', 'Canada', 'H2G 1A7', '+1 (514) 721-4711', None, 'ftremblay@gmail.com', 3)
(4, 'Bjørn', 'Hansen', None, 'Ullevålsveien 14', 'Oslo', None, 'Norway', '0171', '+47 22 44 22 22', None, 'bjorn.hansen@yahoo.no', 4)

In [22]:
#install excel library
%pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (3.1.5)
Requirement already satisfied: et-xmlfile in c:\users\qurat\appdata\local\programs\python\python313\lib\site-packages (from openpyxl) (2.0.0)
Note: you may need to restart the kernel to use updated packages.

In [23]:
# print excel file
print('Preview the dataset using print function')
pd.read_excel('data.xlsx')
df= pd.read_excel('data.xlsx')
print(df)

Preview the dataset using print function
             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0        NaN
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
9        Abdullah     Teacher      M   55.0        NaN
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

In [24]:
# display first 5 rows
df.head()

            Name Designation Gender   Age     Salary
0        Mukhtar   Professor      M  37.0   115000.0
1          Azziz     Teacher      M  30.0    35000.0
2         Mohsin    Engineer      M  29.0    50000.0
3  Naveed Fatima     Analyst      F  30.0    70000.0
4          Babar    Engineer      F  25.0  1500000.0

In [25]:
# display top 10 rows
df.head(10)

            Name Designation Gender   Age     Salary
0        Mukhtar   Professor      M  37.0   115000.0
1          Azziz     Teacher      M  30.0    35000.0
2         Mohsin    Engineer      M  29.0    50000.0
3  Naveed Fatima     Analyst      F  30.0    70000.0
4          Babar    Engineer      F  25.0  1500000.0
5           Aqsa   Scientist      F  22.0        NaN
6          Rafia     Analyst      F  29.0    20000.0
7          Samra   Scientist      F  26.0   115000.0
8           Eman    Engineer      F  28.0    35000.0
9       Abdullah     Teacher      M  55.0        NaN

In [26]:
df.head(3)

      Name Designation Gender   Age    Salary
0  Mukhtar   Professor      M  37.0  115000.0
1    Azziz     Teacher      M  30.0   35000.0
2   Mohsin    Engineer      M  29.0   50000.0

In [27]:
# display bottom rows
df.tail()

      Name Designation Gender    Age    Salary
12   Ahsan     trainer      M  156.0  110000.0
13   Wajid     teacher      M   67.0    2000.0
14   Naeem     trainer      M   80.0   16000.0
15  Qaisar   professor      M   20.0  170000.0
16   Wajid    Engineer      M   85.0  190000.0

In [28]:
#display last one value
df.tail(1)

     Name Designation Gender   Age    Salary
16  Wajid    Engineer      M  85.0  190000.0

In [29]:
#display mid rows
df.loc[8:9]

       Name Designation Gender   Age   Salary
8      Eman    Engineer      F  28.0  35000.0
9  Abdullah     Teacher      M  55.0      NaN

In [30]:
#summary of data
df.describe()

             Age        Salary
count   16.00000  1.500000e+01
mean    48.68750  1.725333e+05
std     35.55975  3.713435e+05
min     20.00000  2.000000e+03
25%     27.50000  3.500000e+04
50%     30.00000  7.000000e+04
75%     61.75000  1.150000e+05
max    156.00000  1.500000e+06

In [31]:
# display rows and columns
df.shape

(17, 5)

In [32]:
#display value of column designation
df['Designation']

0     Professor
1       Teacher
2      Engineer
3       Analyst
4      Engineer
5     Scientist
6       Analyst
7     Scientist
8      Engineer
9       Teacher
10    professor
11     engineer
12      trainer
13      teacher
14      trainer
15    professor
16     Engineer
Name: Designation, dtype: object

In [33]:
#display value of index 1
df.loc[1]

Name             Azziz
Designation    Teacher
Gender               M
Age               30.0
Salary         35000.0
Name: 1, dtype: object

In [34]:
#select two columns
sc = df[['Name' , 'Designation']]
sc

             Name Designation
0         Mukhtar   Professor
1           Azziz     Teacher
2          Mohsin    Engineer
3   Naveed Fatima     Analyst
4           Babar    Engineer
5            Aqsa   Scientist
6           Rafia     Analyst
7           Samra   Scientist
8            Eman    Engineer
9        Abdullah     Teacher
10          Mosib   professor
11          Ahmed    engineer
12          Ahsan     trainer
13          Wajid     teacher
14          Naeem     trainer
15         Qaisar   professor
16          Wajid    Engineer

In [35]:
#selecting three columns
print("Selecting three columns from dataset")
sc=df[['Name','Age','Designation']]
sc

Selecting three columns from dataset

             Name    Age Designation
0         Mukhtar   37.0   Professor
1           Azziz   30.0     Teacher
2          Mohsin   29.0    Engineer
3   Naveed Fatima   30.0     Analyst
4           Babar   25.0    Engineer
5            Aqsa   22.0   Scientist
6           Rafia   29.0     Analyst
7           Samra   26.0   Scientist
8            Eman   28.0    Engineer
9        Abdullah   55.0     Teacher
10          Mosib   60.0   professor
11          Ahmed    NaN    engineer
12          Ahsan  156.0     trainer
13          Wajid   67.0     teacher
14          Naeem   80.0     trainer
15         Qaisar   20.0   professor
16          Wajid   85.0    Engineer

In [36]:
# display name and salary column of row 4,5
df1=df[['Name','Salary']]
df1.loc[4:5]

    Name     Salary
4  Babar  1500000.0
5   Aqsa        NaN

In [37]:
# display name and salary column of row 4,5
df1=df.loc[4:5,['Name','Salary']]
print("Selected rows and columns")
df1

Selected rows and columns

    Name     Salary
4  Babar  1500000.0
5   Aqsa        NaN

In [38]:
# check nullvalue
qurat=df
qurat.isnull().sum()

Name           0
Designation    0
Gender         0
Age            1
Salary         2
dtype: int64

In [39]:
# drop index 9
nd=df.drop(9)
print("Data after dropping index 9")
print(nd)

Data after dropping index 9
             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0        NaN
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

In [40]:
# drop index 5and 9
nd=df.drop(index=[5,9])
print("Data after dropping index 5 and 9")
print(nd)

Data after dropping index 5 and 9
             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

In [41]:
# drop index from 5 to 9
nd=df.drop(index=[5,6,7,8,9])
print("Data after dropping index 5-9")
print(nd)

Data after dropping index 5-9
             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

In [42]:
#drop column gender
nc=df.drop(columns='Gender')
print("Data after dropping column gender")
print(nc)

Data after dropping column gender
             Name Designation    Age     Salary
0         Mukhtar   Professor   37.0   115000.0
1           Azziz     Teacher   30.0    35000.0
2          Mohsin    Engineer   29.0    50000.0
3   Naveed Fatima     Analyst   30.0    70000.0
4           Babar    Engineer   25.0  1500000.0
5            Aqsa   Scientist   22.0        NaN
6           Rafia     Analyst   29.0    20000.0
7           Samra   Scientist   26.0   115000.0
8            Eman    Engineer   28.0    35000.0
9        Abdullah     Teacher   55.0        NaN
10          Mosib   professor   60.0    70000.0
11          Ahmed    engineer    NaN    90000.0
12          Ahsan     trainer  156.0   110000.0
13          Wajid     teacher   67.0     2000.0
14          Naeem     trainer   80.0    16000.0
15         Qaisar   professor   20.0   170000.0
16          Wajid    Engineer   85.0   190000.0

In [43]:
#drop two columns
nc=df.drop(columns=['Gender','Age'])
print("Data after dropping column gender and age")
print(nc)

Data after dropping column gender and age
             Name Designation     Salary
0         Mukhtar   Professor   115000.0
1           Azziz     Teacher    35000.0
2          Mohsin    Engineer    50000.0
3   Naveed Fatima     Analyst    70000.0
4           Babar    Engineer  1500000.0
5            Aqsa   Scientist        NaN
6           Rafia     Analyst    20000.0
7           Samra   Scientist   115000.0
8            Eman    Engineer    35000.0
9        Abdullah     Teacher        NaN
10          Mosib   professor    70000.0
11          Ahmed    engineer    90000.0
12          Ahsan     trainer   110000.0
13          Wajid     teacher     2000.0
14          Naeem     trainer    16000.0
15         Qaisar   professor   170000.0
16          Wajid    Engineer   190000.0

In [44]:
# deal missing value
df.isnull().sum()

Name           0
Designation    0
Gender         0
Age            1
Salary         2
dtype: int64

In [45]:
# deal missing value
df['Age'].isnull().sum()

np.int64(1)

In [46]:
#replace null values
df['Age']=df['Age'].fillna(df['Age'].median())
df['Age']

0      37.0
1      30.0
2      29.0
3      30.0
4      25.0
5      22.0
6      29.0
7      26.0
8      28.0
9      55.0
10     60.0
11     30.0
12    156.0
13     67.0
14     80.0
15     20.0
16     85.0
Name: Age, dtype: float64

In [47]:
#loading dataset csv
pd.read_csv("data.csv")
df=pd.read_csv("data.csv")
print("Students dataset")
df

Students dataset

             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
5            Aqsa   Scientist      F   22.0        NaN
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
9        Abdullah     Teacher      M   55.0        NaN
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

In [48]:
#display specific feature or column
df['Salary']

0      115000.0
1       35000.0
2       50000.0
3       70000.0
4     1500000.0
5           NaN
6       20000.0
7      115000.0
8       35000.0
9           NaN
10      70000.0
11      90000.0
12     110000.0
13       2000.0
14      16000.0
15     170000.0
16     190000.0
Name: Salary, dtype: float64

In [49]:
#select two columns
sc = df[['Name' , 'Designation']]
sc

             Name Designation
0         Mukhtar   Professor
1           Azziz     Teacher
2          Mohsin    Engineer
3   Naveed Fatima     Analyst
4           Babar    Engineer
5            Aqsa   Scientist
6           Rafia     Analyst
7           Samra   Scientist
8            Eman    Engineer
9        Abdullah     Teacher
10          Mosib   professor
11          Ahmed    engineer
12          Ahsan     trainer
13          Wajid     teacher
14          Naeem     trainer
15         Qaisar   professor
16          Wajid    Engineer

In [50]:
#select three columns
print("Selecting three columns from dataset")
sc=df[['Name','Age','Designation']]
sc

Selecting three columns from dataset

             Name    Age Designation
0         Mukhtar   37.0   Professor
1           Azziz   30.0     Teacher
2          Mohsin   29.0    Engineer
3   Naveed Fatima   30.0     Analyst
4           Babar   25.0    Engineer
5            Aqsa   22.0   Scientist
6           Rafia   29.0     Analyst
7           Samra   26.0   Scientist
8            Eman   28.0    Engineer
9        Abdullah   55.0     Teacher
10          Mosib   60.0   professor
11          Ahmed    NaN    engineer
12          Ahsan  156.0     trainer
13          Wajid   67.0     teacher
14          Naeem   80.0     trainer
15         Qaisar   20.0   professor
16          Wajid   85.0    Engineer

In [51]:
# display columns values at specific index
df1=df.loc[1:4,['Name','Salary']]
print("Selected rows and columns")
df1

Selected rows and columns

            Name     Salary
1          Azziz    35000.0
2         Mohsin    50000.0
3  Naveed Fatima    70000.0
4          Babar  1500000.0

In [52]:
# check null values
qurat=df
qurat.isnull().sum()

Name           0
Designation    0
Gender         0
Age            1
Salary         2
dtype: int64

In [53]:
#drop values at 2 indexes
nd=df.drop(index=[5,9])
print("Data after dropping index 5-9")
print(nd)

Data after dropping index 5-9
             Name Designation Gender    Age     Salary
0         Mukhtar   Professor      M   37.0   115000.0
1           Azziz     Teacher      M   30.0    35000.0
2          Mohsin    Engineer      M   29.0    50000.0
3   Naveed Fatima     Analyst      F   30.0    70000.0
4           Babar    Engineer      F   25.0  1500000.0
6           Rafia     Analyst      F   29.0    20000.0
7           Samra   Scientist      F   26.0   115000.0
8            Eman    Engineer      F   28.0    35000.0
10          Mosib   professor      M   60.0    70000.0
11          Ahmed    engineer      M    NaN    90000.0
12          Ahsan     trainer      M  156.0   110000.0
13          Wajid     teacher      M   67.0     2000.0
14          Naeem     trainer      M   80.0    16000.0
15         Qaisar   professor      M   20.0   170000.0
16          Wajid    Engineer      M   85.0   190000.0

In [54]:
#drop a specific feature or column
nc=df.drop(columns='Gender')
print("Data after dropping column gender")
print(nc)

Data after dropping column gender
             Name Designation    Age     Salary
0         Mukhtar   Professor   37.0   115000.0
1           Azziz     Teacher   30.0    35000.0
2          Mohsin    Engineer   29.0    50000.0
3   Naveed Fatima     Analyst   30.0    70000.0
4           Babar    Engineer   25.0  1500000.0
5            Aqsa   Scientist   22.0        NaN
6           Rafia     Analyst   29.0    20000.0
7           Samra   Scientist   26.0   115000.0
8            Eman    Engineer   28.0    35000.0
9        Abdullah     Teacher   55.0        NaN
10          Mosib   professor   60.0    70000.0
11          Ahmed    engineer    NaN    90000.0
12          Ahsan     trainer  156.0   110000.0
13          Wajid     teacher   67.0     2000.0
14          Naeem     trainer   80.0    16000.0
15         Qaisar   professor   20.0   170000.0
16          Wajid    Engineer   85.0   190000.0

In [55]:

#drop two columns
nc=df.drop(columns=['Gender','Age'])
print("Data after dropping column gender and age")
print(nc)

Data after dropping column gender and age
             Name Designation     Salary
0         Mukhtar   Professor   115000.0
1           Azziz     Teacher    35000.0
2          Mohsin    Engineer    50000.0
3   Naveed Fatima     Analyst    70000.0
4           Babar    Engineer  1500000.0
5            Aqsa   Scientist        NaN
6           Rafia     Analyst    20000.0
7           Samra   Scientist   115000.0
8            Eman    Engineer    35000.0
9        Abdullah     Teacher        NaN
10          Mosib   professor    70000.0
11          Ahmed    engineer    90000.0
12          Ahsan     trainer   110000.0
13          Wajid     teacher     2000.0
14          Naeem     trainer    16000.0
15         Qaisar   professor   170000.0
16          Wajid    Engineer   190000.0

In [56]:
df['Age']=df['Age'].fillna(df['Age'].mean())
df['Age']

0      37.0000
1      30.0000
2      29.0000
3      30.0000
4      25.0000
5      22.0000
6      29.0000
7      26.0000
8      28.0000
9      55.0000
10     60.0000
11     48.6875
12    156.0000
13     67.0000
14     80.0000
15     20.0000
16     85.0000
Name: Age, dtype: float64

In [57]:
print('check for null values now')
print(df['Age'].isnull().sum())

check for null values now
0

In [58]:
df = df.dropna(subset=['Salary'])
print(df)

             Name Designation Gender       Age     Salary
0         Mukhtar   Professor      M   37.0000   115000.0
1           Azziz     Teacher      M   30.0000    35000.0
2          Mohsin    Engineer      M   29.0000    50000.0
3   Naveed Fatima     Analyst      F   30.0000    70000.0
4           Babar    Engineer      F   25.0000  1500000.0
6           Rafia     Analyst      F   29.0000    20000.0
7           Samra   Scientist      F   26.0000   115000.0
8            Eman    Engineer      F   28.0000    35000.0
10          Mosib   professor      M   60.0000    70000.0
11          Ahmed    engineer      M   48.6875    90000.0
12          Ahsan     trainer      M  156.0000   110000.0
13          Wajid     teacher      M   67.0000     2000.0
14          Naeem     trainer      M   80.0000    16000.0
15         Qaisar   professor      M   20.0000   170000.0
16          Wajid    Engineer      M   85.0000   190000.0

In [59]:
# high salary greater than 50000
hs= df[df['Salary']>50000]
print(hs)

             Name Designation Gender       Age     Salary
0         Mukhtar   Professor      M   37.0000   115000.0
3   Naveed Fatima     Analyst      F   30.0000    70000.0
4           Babar    Engineer      F   25.0000  1500000.0
7           Samra   Scientist      F   26.0000   115000.0
10          Mosib   professor      M   60.0000    70000.0
11          Ahmed    engineer      M   48.6875    90000.0
12          Ahsan     trainer      M  156.0000   110000.0
15         Qaisar   professor      M   20.0000   170000.0
16          Wajid    Engineer      M   85.0000   190000.0

In [60]:
#sort data
sd=df.sort_values(by='Age',ascending=True)
print(sd)

             Name Designation Gender       Age     Salary
15         Qaisar   professor      M   20.0000   170000.0
4           Babar    Engineer      F   25.0000  1500000.0
7           Samra   Scientist      F   26.0000   115000.0
8            Eman    Engineer      F   28.0000    35000.0
6           Rafia     Analyst      F   29.0000    20000.0
2          Mohsin    Engineer      M   29.0000    50000.0
3   Naveed Fatima     Analyst      F   30.0000    70000.0
1           Azziz     Teacher      M   30.0000    35000.0
0         Mukhtar   Professor      M   37.0000   115000.0
11          Ahmed    engineer      M   48.6875    90000.0
10          Mosib   professor      M   60.0000    70000.0
13          Wajid     teacher      M   67.0000     2000.0
14          Naeem     trainer      M   80.0000    16000.0
16          Wajid    Engineer      M   85.0000   190000.0
12          Ahsan     trainer      M  156.0000   110000.0

In [61]:
#grouped and aggregate
grp=df.groupby('Designation')['Salary'].mean()
print(grp)

Designation
Analyst       45000.0
Engineer     443750.0
Professor    115000.0
Scientist    115000.0
Teacher       35000.0
engineer      90000.0
professor    120000.0
teacher        2000.0
trainer       63000.0
Name: Salary, dtype: float64

In [62]:
#step8:Enter a new column
df['Experience_level']=['Senior'if age>35 else 'Junior'for age in df['Age']]
print("\n Add a new column Experience level")
print (df)

 Add a new column Experience level
             Name Designation Gender       Age     Salary Experience_level
0         Mukhtar   Professor      M   37.0000   115000.0           Senior
1           Azziz     Teacher      M   30.0000    35000.0           Junior
2          Mohsin    Engineer      M   29.0000    50000.0           Junior
3   Naveed Fatima     Analyst      F   30.0000    70000.0           Junior
4           Babar    Engineer      F   25.0000  1500000.0           Junior
6           Rafia     Analyst      F   29.0000    20000.0           Junior
7           Samra   Scientist      F   26.0000   115000.0           Junior
8            Eman    Engineer      F   28.0000    35000.0           Junior
10          Mosib   professor      M   60.0000    70000.0           Senior
11          Ahmed    engineer      M   48.6875    90000.0           Senior
12          Ahsan     trainer      M  156.0000   110000.0           Senior
13          Wajid     teacher      M   67.0000     2000.0           Senior
14          Naeem     trainer      M   80.0000    16000.0           Senior
15         Qaisar   professor      M   20.0000   170000.0           Junior
16          Wajid    Engineer      M   85.0000   190000.0           Senior

C:\Users\qurat\AppData\Local\Temp\ipykernel_11728\2912126390.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['Experience_level']=['Senior'if age>35 else 'Junior'for age in df['Age']]